#include <xc.h>
#include"init_md24.h"

/* =============================================================================
 * 名  称：控制DO端口输出函数
 * 输  入：
 * 输  出：
 * 功  能：从EEPROM中读取设置值，输出到DO端口
 * ===========================================================================*/
void MD24_SETDO(void)
{
    unsigned char temp = 0;
    for(char i = 15; i > 0; i -= 2 )  //
    {
        temp <<= 1;
        temp += EEPROM_READ(0x20 + i);
    }
    PORTC = temp;
}

/* =============================================================================
 * 名  称：将DI状态写入EEPROM
 * 输  入：
 * 输  出：
 * 功  能：将DI状态写入EEPROM(DI4~DI7始终设为1）
 * ===========================================================================*/
void MD24_GETDI(void)
{
    unsigned char temp[16]={ 0x00,0x00, 0x00,0x00, 0x00,0x00, 0x00,0x00,
                             0x00,0x01, 0x00,0x01, 0x00,0x01, 0x00,0x01 };
    unsigned char porta = PORTA & 0x0F; //取A端口低4位状态
    for( char i = 1; i < 8; i += 2 )
    {
        temp[i] = porta & 0x01;
        porta >>= 1;
    }
    memcpyee(0x40,temp,16); //结果存入EEPROM
}